# 1번 문제

In [8]:
import pandas as pd
import numpy as np

car = pd.read_csv('data/car_stocks.csv')
car.groupby('Symbol')['Open'].max()

Symbol
GM       64.330002
LCID     56.200001
RIVN    163.800003
Name: Open, dtype: float64

In [13]:
import pandas as pd
import numpy as np

titanic = pd.read_csv('data/titanic.csv')
titanic['age'] = titanic['age'].replace(['?'],[None]).astype('float')
titanic['age']

0       29.0000
1        0.9167
2        2.0000
3       30.0000
4       25.0000
         ...
1304    14.5000
1305        NaN
1306    26.5000
1307    27.0000
1308    29.0000
Name: age, Length: 1309, dtype: float64

In [26]:
import pandas as pd
import numpy as np

titanic = pd.read_csv('data/titanic.csv')
titanic['age'] = titanic['age'].replace(['?'],[None]).astype('float')
df = titanic[titanic['sex']=='male']
df[['pclass','survived','age']].mean()

pclass       2.372479
survived     0.190985
age         30.585233
dtype: float64

In [38]:
import pandas as pd
import numpy as np

titanic = pd.read_csv('data/titanic.csv')
titanic['age'] = titanic['age'].replace(['?'],[None]).astype('float')
female = titanic[titanic['sex']=='female']
female[['pclass','survived','sex','age']]

      pclass  survived     sex   age
0          1         1  female  29.0
2          1         0  female   2.0
4          1         0  female  25.0
6          1         1  female  63.0
8          1         1  female  53.0
...      ...       ...     ...   ...
1286       3         1  female  38.0
1290       3         1  female  47.0
1300       3         1  female  15.0
1304       3         0  female  14.5
1305       3         0  female   NaN

[466 rows x 4 columns]

In [41]:
import pandas as pd
import numpy as np

titanic = pd.read_csv('data/titanic.csv')
titanic['age'] = titanic['age'].replace(['?'],[None]).astype('float')
titanic.groupby('sex')['age'].agg({'max','min'})

           min   max
sex
female  0.1667  76.0
male    0.3333  80.0

In [46]:
import pandas as pd
import numpy as np

titanic = pd.read_csv('data/titanic.csv')
titanic['age'] = titanic['age'].replace(['?'],[None]).astype('float')
titanic.groupby('sex').agg({'age':['max','min'],'pclass':['mean']})

         age            pclass
         max     min      mean
sex
female  76.0  0.1667  2.154506
male    80.0  0.3333  2.372479

### 타이타닉 탑승자의 pclass에 따른 나이의 최대, 최소 그리고 최대값과 최소값의 차이를 한 표에 나타내도록 코딩하세요.

In [58]:
import pandas as pd
import numpy as np

titanic = pd.read_csv('data/titanic.csv')
titanic['age'] = titanic['age'].replace(['?'],[None]).astype('float')

def range(i):
    return i.max()-i.min()

titanic.groupby('pclass')['age'].agg({'max','min',range})

           min   max    range
pclass
1       0.9167  80.0  79.0833
2       0.6667  70.0  69.3333
3       0.1667  74.0  73.8333

### 타이타닉 탑승자의 pclass 별로 age 데이터가 없는 경우의 총합을 코딩하여 구하세요.

In [79]:
titanic.head(1)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"

In [98]:
import pandas as pd
import numpy as np

titanic = pd.read_csv('data/titanic.csv')
titanic['age'] = titanic['age'].replace(['?'],[None]).astype('float')

# titanic.groupby('pclass')['age'].size()-titanic.groupby('pclass')['age'].count()
def h(i):
    return i.size-i.count()

titanic.groupby('pclass')['age'].agg(h)

pclass
1     39
2     16
3    208
Name: age, dtype: int64

In [68]:
import pandas as pd
import numpy as np

car = pd.read_csv('data/car_stocks.csv')
car.groupby('Symbol').agg({'Open':['max','min'],'Close':['max','min']})

              Open                   Close
               max         min         max         min
Symbol
GM       64.330002   57.849998   64.610001   59.270000
LCID     56.200001   42.299999   55.520000   40.750000
RIVN    163.800003  106.750000  172.009995  100.730003

### 자동차 주식 정보 데이터를 활용하여 시가의 최대 최소값을 각각 open_smallest, open_biggest라는 이름으로 나타내시고, 종가의 최소값과 최대값을 각각 close_smallest, close_biggest 로 나타내도록 코딩하세요.

In [76]:
import pandas as pd
import numpy as np

car = pd.read_csv('data/car_stocks.csv')
car.groupby('Symbol').agg(open_smallest=('Open','min'),open_biggest=('Open','max'),
                         close_smallest=('Close','min'),close_biggest=('Close','max'))

        open_smallest  open_biggest  close_smallest  close_biggest
Symbol
GM          57.849998     64.330002       59.270000      64.610001
LCID        42.299999     56.200001       40.750000      55.520000
RIVN       106.750000    163.800003      100.730003     172.009995